---
title: DocumentPrintedEventArgs
classe: Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# DocumentPrintedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `IList<ElementId> GetFailedViewElementIds()` | `documentPrintedEventArgs.GetFailedViewElementIds()` | IList<ElementId> |
| `IList<ElementId> GetPrintedViewElementIds()` | `documentPrintedEventArgs.GetPrintedViewElementIds()` | IList<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```